HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPort_bf.h
/**
 * \file IfxPort_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC38XA_UM_V1.0.0.R0
 * Specification: TC3xx User Manual V1.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_P_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_P_Registers
 * 
 */
#ifndef IFXPORT_BF_H
#define IFXPORT_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_P_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_P_OUT_Bits.P0 */
#define IFX_P_OUT_P0_LEN (1u)

/** \brief Mask for Ifx_P_OUT_Bits.P0 */
#define IFX_P_OUT_P0_MSK (0x1u)

/** \brief Offset for Ifx_P_OUT_Bits.P0 */
#define IFX_P_OUT_P0_OFF (0u)

/** \brief Length for Ifx_P_OUT_Bits.P1 */
#define IFX_P_OUT_P1_LEN (1u)

/** \brief Mask for Ifx_P_OUT_Bits.P1 */
#define IFX_P_OUT_P1_MSK (0x1u)

/** \brief Offset for Ifx_P_OUT_Bits.P1 */
#define IFX_P_OUT_P1_OFF (1u)

/** \brief Length for Ifx_P_OUT_Bits.P2 */
#define IFX_P_OUT_P2_LEN (1u)

/** \brief Mask for Ifx_P_OUT_Bits.P2 */
#define IFX_P_OUT_P2_MSK (0x1u)

/** \brief Offset for Ifx_P_OUT_Bits.P2 */
#define IFX_P_OUT_P2_OFF (2u)

/** \brief Length for Ifx_P_OUT_Bits.P3 */
#define IFX_P_OUT_P3_LEN (1u)

/** \brief Mask for Ifx_P_OUT_Bits.P3 */
#define IFX_P_OUT_P3_MSK (0x1u)

/** \brief Offset for Ifx_P_OUT_Bits.P3 */
#define IFX_P_OUT_P3_OFF (3u)

/** \brief Length for Ifx_P_OUT_Bits.P4 */
#define IFX_P_OUT_P4_LEN (1u)

/** \brief Mask for Ifx_P_OUT_Bits.P4 */
#define IFX_P_OUT_P4_MSK (0x1u)

/** \brief Offset for Ifx_P_OUT_Bits.P4 */
#define IFX_P_OUT_P4_OFF (4u)

/** \brief Length for Ifx_P_OUT_Bits.P5 */
#define IFX_P_OUT_P5_LEN (1u)

/** \brief Mask for Ifx_P_OUT_Bits.P5 */
#define IFX_P_OUT_P5_MSK (0x1u)

/** \brief Offset for Ifx_P_OUT_Bits.P5 */
#define IFX_P_OUT_P5_OFF (5u)

/** \brief Length for Ifx_P_OUT_Bits.P6 */
#define IFX_P_OUT_P6_LEN (1u)

/** \brief Mask for Ifx_P_OUT_Bits.P6 */
#define IFX_P_OUT_P6_MSK (0x1u)

/** \brief Offset for Ifx_P_OUT_Bits.P6 */
#define IFX_P_OUT_P6_OFF (6u)

/** \brief Length for Ifx_P_OUT_Bits.P7 */
#define IFX_P_OUT_P7_LEN (1u)

/** \brief Mask for Ifx_P_OUT_Bits.P7 */
#define IFX_P_OUT_P7_MSK (0x1u)

/** \brief Offset for Ifx_P_OUT_Bits.P7 */
#define IFX_P_OUT_P7_OFF (7u)

/** \brief Length for Ifx_P_OUT_Bits.P8 */
#define IFX_P_OUT_P8_LEN (1u)

/** \brief Mask for Ifx_P_OUT_Bits.P8 */
#define IFX_P_OUT_P8_MSK (0x1u)

/** \brief Offset for Ifx_P_OUT_Bits.P8 */
#define IFX_P_OUT_P8_OFF (8u)

/** \brief Length for Ifx_P_OUT_Bits.P9 */
#define IFX_P_OUT_P9_LEN (1u)

/** \brief Mask for Ifx_P_OUT_Bits.P9 */
#define IFX_P_OUT_P9_MSK (0x1u)

/** \brief Offset for Ifx_P_OUT_Bits.P9 */
#define IFX_P_OUT_P9_OFF (9u)

/** \brief Length for Ifx_P_OUT_Bits.P10 */
#define IFX_P_OUT_P10_LEN (1u)

/** \brief Mask for Ifx_P_OUT_Bits.P10 */
#define IFX_P_OUT_P10_MSK (0x1u)

/** \brief Offset for Ifx_P_OUT_Bits.P10 */
#define IFX_P_OUT_P10_OFF (10u)

/** \brief Length for Ifx_P_OUT_Bits.P11 */
#define IFX_P_OUT_P11_LEN (1u)

/** \brief Mask for Ifx_P_OUT_Bits.P11 */
#define IFX_P_OUT_P11_MSK (0x1u)

/** \brief Offset for Ifx_P_OUT_Bits.P11 */
#define IFX_P_OUT_P11_OFF (11u)

/** \brief Length for Ifx_P_OUT_Bits.P12 */
#define IFX_P_OUT_P12_LEN (1u)

/** \brief Mask for Ifx_P_OUT_Bits.P12 */
#define IFX_P_OUT_P12_MSK (0x1u)

/** \brief Offset for Ifx_P_OUT_Bits.P12 */
#define IFX_P_OUT_P12_OFF (12u)

/** \brief Length for Ifx_P_OUT_Bits.P13 */
#define IFX_P_OUT_P13_LEN (1u)

/** \brief Mask for Ifx_P_OUT_Bits.P13 */
#define IFX_P_OUT_P13_MSK (0x1u)

/** \brief Offset for Ifx_P_OUT_Bits.P13 */
#define IFX_P_OUT_P13_OFF (13u)

/** \brief Length for Ifx_P_OUT_Bits.P14 */
#define IFX_P_OUT_P14_LEN (1u)

/** \brief Mask for Ifx_P_OUT_Bits.P14 */
#define IFX_P_OUT_P14_MSK (0x1u)

/** \brief Offset for Ifx_P_OUT_Bits.P14 */
#define IFX_P_OUT_P14_OFF (14u)

/** \brief Length for Ifx_P_OUT_Bits.P15 */
#define IFX_P_OUT_P15_LEN (1u)

/** \brief Mask for Ifx_P_OUT_Bits.P15 */
#define IFX_P_OUT_P15_MSK (0x1u)

/** \brief Offset for Ifx_P_OUT_Bits.P15 */
#define IFX_P_OUT_P15_OFF (15u)

/** \brief Length for Ifx_P_OMR_Bits.PS0 */
#define IFX_P_OMR_PS0_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PS0 */
#define IFX_P_OMR_PS0_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PS0 */
#define IFX_P_OMR_PS0_OFF (0u)

/** \brief Length for Ifx_P_OMR_Bits.PS1 */
#define IFX_P_OMR_PS1_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PS1 */
#define IFX_P_OMR_PS1_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PS1 */
#define IFX_P_OMR_PS1_OFF (1u)

/** \brief Length for Ifx_P_OMR_Bits.PS2 */
#define IFX_P_OMR_PS2_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PS2 */
#define IFX_P_OMR_PS2_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PS2 */
#define IFX_P_OMR_PS2_OFF (2u)

/** \brief Length for Ifx_P_OMR_Bits.PS3 */
#define IFX_P_OMR_PS3_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PS3 */
#define IFX_P_OMR_PS3_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PS3 */
#define IFX_P_OMR_PS3_OFF (3u)

/** \brief Length for Ifx_P_OMR_Bits.PS4 */
#define IFX_P_OMR_PS4_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PS4 */
#define IFX_P_OMR_PS4_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PS4 */
#define IFX_P_OMR_PS4_OFF (4u)

/** \brief Length for Ifx_P_OMR_Bits.PS5 */
#define IFX_P_OMR_PS5_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PS5 */
#define IFX_P_OMR_PS5_MSK (0x1u)

