HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPort_bf.h
/** \brief Offset for Ifx_P_OMSR12_Bits.PS15 */
#define IFX_P_OMSR12_PS15_OFF (15u)

/** \brief Length for Ifx_P_OMCR0_Bits.PCL0 */
#define IFX_P_OMCR0_PCL0_LEN (1u)

/** \brief Mask for Ifx_P_OMCR0_Bits.PCL0 */
#define IFX_P_OMCR0_PCL0_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR0_Bits.PCL0 */
#define IFX_P_OMCR0_PCL0_OFF (16u)

/** \brief Length for Ifx_P_OMCR0_Bits.PCL1 */
#define IFX_P_OMCR0_PCL1_LEN (1u)

/** \brief Mask for Ifx_P_OMCR0_Bits.PCL1 */
#define IFX_P_OMCR0_PCL1_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR0_Bits.PCL1 */
#define IFX_P_OMCR0_PCL1_OFF (17u)

/** \brief Length for Ifx_P_OMCR0_Bits.PCL2 */
#define IFX_P_OMCR0_PCL2_LEN (1u)

/** \brief Mask for Ifx_P_OMCR0_Bits.PCL2 */
#define IFX_P_OMCR0_PCL2_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR0_Bits.PCL2 */
#define IFX_P_OMCR0_PCL2_OFF (18u)

/** \brief Length for Ifx_P_OMCR0_Bits.PCL3 */
#define IFX_P_OMCR0_PCL3_LEN (1u)

/** \brief Mask for Ifx_P_OMCR0_Bits.PCL3 */
#define IFX_P_OMCR0_PCL3_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR0_Bits.PCL3 */
#define IFX_P_OMCR0_PCL3_OFF (19u)

/** \brief Length for Ifx_P_OMCR4_Bits.PCL4 */
#define IFX_P_OMCR4_PCL4_LEN (1u)

/** \brief Mask for Ifx_P_OMCR4_Bits.PCL4 */
#define IFX_P_OMCR4_PCL4_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR4_Bits.PCL4 */
#define IFX_P_OMCR4_PCL4_OFF (20u)

/** \brief Length for Ifx_P_OMCR4_Bits.PCL5 */
#define IFX_P_OMCR4_PCL5_LEN (1u)

/** \brief Mask for Ifx_P_OMCR4_Bits.PCL5 */
#define IFX_P_OMCR4_PCL5_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR4_Bits.PCL5 */
#define IFX_P_OMCR4_PCL5_OFF (21u)

/** \brief Length for Ifx_P_OMCR4_Bits.PCL6 */
#define IFX_P_OMCR4_PCL6_LEN (1u)

/** \brief Mask for Ifx_P_OMCR4_Bits.PCL6 */
#define IFX_P_OMCR4_PCL6_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR4_Bits.PCL6 */
#define IFX_P_OMCR4_PCL6_OFF (22u)

/** \brief Length for Ifx_P_OMCR4_Bits.PCL7 */
#define IFX_P_OMCR4_PCL7_LEN (1u)

/** \brief Mask for Ifx_P_OMCR4_Bits.PCL7 */
#define IFX_P_OMCR4_PCL7_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR4_Bits.PCL7 */
#define IFX_P_OMCR4_PCL7_OFF (23u)

/** \brief Length for Ifx_P_OMCR8_Bits.PCL8 */
#define IFX_P_OMCR8_PCL8_LEN (1u)

/** \brief Mask for Ifx_P_OMCR8_Bits.PCL8 */
#define IFX_P_OMCR8_PCL8_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR8_Bits.PCL8 */
#define IFX_P_OMCR8_PCL8_OFF (24u)

/** \brief Length for Ifx_P_OMCR8_Bits.PCL9 */
#define IFX_P_OMCR8_PCL9_LEN (1u)

/** \brief Mask for Ifx_P_OMCR8_Bits.PCL9 */
#define IFX_P_OMCR8_PCL9_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR8_Bits.PCL9 */
#define IFX_P_OMCR8_PCL9_OFF (25u)

/** \brief Length for Ifx_P_OMCR8_Bits.PCL10 */
#define IFX_P_OMCR8_PCL10_LEN (1u)

/** \brief Mask for Ifx_P_OMCR8_Bits.PCL10 */
#define IFX_P_OMCR8_PCL10_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR8_Bits.PCL10 */
#define IFX_P_OMCR8_PCL10_OFF (26u)

/** \brief Length for Ifx_P_OMCR8_Bits.PCL11 */
#define IFX_P_OMCR8_PCL11_LEN (1u)

/** \brief Mask for Ifx_P_OMCR8_Bits.PCL11 */
#define IFX_P_OMCR8_PCL11_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR8_Bits.PCL11 */
#define IFX_P_OMCR8_PCL11_OFF (27u)

/** \brief Length for Ifx_P_OMCR12_Bits.PCL12 */
#define IFX_P_OMCR12_PCL12_LEN (1u)

/** \brief Mask for Ifx_P_OMCR12_Bits.PCL12 */
#define IFX_P_OMCR12_PCL12_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR12_Bits.PCL12 */
#define IFX_P_OMCR12_PCL12_OFF (28u)

/** \brief Length for Ifx_P_OMCR12_Bits.PCL13 */
#define IFX_P_OMCR12_PCL13_LEN (1u)

/** \brief Mask for Ifx_P_OMCR12_Bits.PCL13 */
#define IFX_P_OMCR12_PCL13_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR12_Bits.PCL13 */
#define IFX_P_OMCR12_PCL13_OFF (29u)

/** \brief Length for Ifx_P_OMCR12_Bits.PCL14 */
#define IFX_P_OMCR12_PCL14_LEN (1u)

/** \brief Mask for Ifx_P_OMCR12_Bits.PCL14 */
#define IFX_P_OMCR12_PCL14_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR12_Bits.PCL14 */
#define IFX_P_OMCR12_PCL14_OFF (30u)

/** \brief Length for Ifx_P_OMCR12_Bits.PCL15 */
#define IFX_P_OMCR12_PCL15_LEN (1u)

/** \brief Mask for Ifx_P_OMCR12_Bits.PCL15 */
#define IFX_P_OMCR12_PCL15_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR12_Bits.PCL15 */
#define IFX_P_OMCR12_PCL15_OFF (31u)

/** \brief Length for Ifx_P_OMSR_Bits.PS0 */
#define IFX_P_OMSR_PS0_LEN (1u)

/** \brief Mask for Ifx_P_OMSR_Bits.PS0 */
#define IFX_P_OMSR_PS0_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR_Bits.PS0 */
#define IFX_P_OMSR_PS0_OFF (0u)

/** \brief Length for Ifx_P_OMSR_Bits.PS1 */
#define IFX_P_OMSR_PS1_LEN (1u)

/** \brief Mask for Ifx_P_OMSR_Bits.PS1 */
#define IFX_P_OMSR_PS1_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR_Bits.PS1 */
#define IFX_P_OMSR_PS1_OFF (1u)

/** \brief Length for Ifx_P_OMSR_Bits.PS2 */
#define IFX_P_OMSR_PS2_LEN (1u)

/** \brief Mask for Ifx_P_OMSR_Bits.PS2 */
#define IFX_P_OMSR_PS2_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR_Bits.PS2 */
#define IFX_P_OMSR_PS2_OFF (2u)

/** \brief Length for Ifx_P_OMSR_Bits.PS3 */
#define IFX_P_OMSR_PS3_LEN (1u)

/** \brief Mask for Ifx_P_OMSR_Bits.PS3 */
#define IFX_P_OMSR_PS3_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR_Bits.PS3 */
#define IFX_P_OMSR_PS3_OFF (3u)

/** \brief Length for Ifx_P_OMSR_Bits.PS4 */
#define IFX_P_OMSR_PS4_LEN (1u)

/** \brief Mask for Ifx_P_OMSR_Bits.PS4 */
#define IFX_P_OMSR_PS4_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR_Bits.PS4 */
#define IFX_P_OMSR_PS4_OFF (4u)

/** \brief Length for Ifx_P_OMSR_Bits.PS5 */
#define IFX_P_OMSR_PS5_LEN (1u)

/** \brief Mask for Ifx_P_OMSR_Bits.PS5 */
#define IFX_P_OMSR_PS5_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR_Bits.PS5 */
#define IFX_P_OMSR_PS5_OFF (5u)

/** \brief Length for Ifx_P_OMSR_Bits.PS6 */
#define IFX_P_OMSR_PS6_LEN (1u)

/** \brief Mask for Ifx_P_OMSR_Bits.PS6 */
#define IFX_P_OMSR_PS6_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR_Bits.PS6 */
#define IFX_P_OMSR_PS6_OFF (6u)

/** \brief Length for Ifx_P_OMSR_Bits.PS7 */
#define IFX_P_OMSR_PS7_LEN (1u)

/** \brief Mask for Ifx_P_OMSR_Bits.PS7 */
#define IFX_P_OMSR_PS7_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR_Bits.PS7 */
#define IFX_P_OMSR_PS7_OFF (7u)

/** \brief Length for Ifx_P_OMSR_Bits.PS8 */
#define IFX_P_OMSR_PS8_LEN (1u)

